52n-ses-integration-test/src/test/resources/org/n52/ses/common/integration/test/PatternPlusNotMatchingXPathSubscription.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
	<soap:Header>
		<wsa:To>${ses_host}</wsa:To>
		<wsa:Action>http://docs.oasis-open.org/wsn/bw-2/NotificationProducer/SubscribeRequest
		</wsa:Action>
		<wsa:MessageID>uuid:4e595160-185a-9b3c-3eb6-592c7c5b0c7a
		</wsa:MessageID>
		<wsa:From>
			<wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous
			</wsa:Address>
		</wsa:From>
	</soap:Header>
	<soap:Body>
		<wsnt:Subscribe>
			<wsnt:ConsumerReference>
				<wsa:Address>${consumer}</wsa:Address>
			</wsnt:ConsumerReference>
			<wsnt:Filter>
				<wsnt:MessageContent Dialect="http://www.w3.org/TR/1999/REC-xpath-19991116"
					xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:om="http://www.opengis.net/om/1.0">
					//om:Observation/om:procedure[@xlink:href='Waterständ-List_Auf_Sylt_9570070']
				</wsnt:MessageContent>
				<wsnt:MessageContent Dialect="http://www.opengis.net/ses/filter/level3">
					<EML xmlns="http://www.opengis.net/eml/0.0.1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
						xsi:schemaLocation="http://www.opengis.net/eml/0.0.1 3111_XSDeml0.0.1OGC-EML-0_0_1-eml.xsd">
						<SimplePatterns>
							<SimplePattern inputName="input"
								patternID="Wasserstand_LIST_AUF_SYLT_over_undershoot_overshoot_stream">
								<SelectFunctions>
									<SelectFunction createCausality="false"
										newEventName="Wasserstand_LIST_AUF_SYLT_over_undershoot_overshoot">
										<SelectEvent eventName="input" />
									</SelectFunction>
								</SelectFunctions>
								<View>
									<LengthView>
										<EventCount>1</EventCount>
									</LengthView>
								</View>
								<Guard>
									<fes:Filter xmlns:fes="http://www.opengis.net/fes/2.0">
										<fes:PropertyIsGreaterThan>
											<fes:ValueReference>input/doubleValue</fes:ValueReference>
											<fes:Literal>460</fes:Literal>
										</fes:PropertyIsGreaterThan>
									</fes:Filter>
								</Guard>
								<PropertyRestrictions>
									<PropertyRestriction>
										<name>observedProperty</name>
										<value>Wasserstand</value>
									</PropertyRestriction>
									<PropertyRestriction>
										<name>sensorID</name>
										<value>Wasserstand-List_Auf_Sylt_9570070</value>
									</PropertyRestriction>
								</PropertyRestrictions>
							</SimplePattern>
							<SimplePattern inputName="input"
								patternID="Wasserstand_LIST_AUF_SYLT_over_undershoot_undershoot_stream">
								<SelectFunctions>
									<SelectFunction createCausality="false"
										newEventName="Wasserstand_LIST_AUF_SYLT_over_undershoot_undershoot">
										<SelectEvent eventName="input" />
									</SelectFunction>
								</SelectFunctions>
								<View>
									<LengthView>
										<EventCount>1</EventCount>
									</LengthView>
								</View>
								<Guard>
									<fes:Filter xmlns:fes="http://www.opengis.net/fes/2.0">
										<fes:PropertyIsLessThanOrEqualTo>
											<fes:ValueReference>input/doubleValue</fes:ValueReference>
											<fes:Literal>460</fes:Literal>
										</fes:PropertyIsLessThanOrEqualTo>
									</fes:Filter>
								</Guard>
								<PropertyRestrictions>
									<PropertyRestriction>
										<name>observedProperty</name>
										<value>Wasserstand</value>
									</PropertyRestriction>
									<PropertyRestriction>
										<name>sensorID</name>
										<value>Wasserstand-List_Auf_Sylt_9570070</value>
									</PropertyRestriction>
								</PropertyRestrictions>
							</SimplePattern>
						</SimplePatterns>
						<ComplexPatterns>
							<!-- Einstiegsklausel -->
							<ComplexPattern
								patternID="Wasserstand_LIST_AUF_SYLT_over_undershoot_overshoot_notification_stream">
								<SelectFunctions>
									<SelectFunction createCausality="true"
										newEventName="Wasserstand_LIST_AUF_SYLT_over_undershoot_overshoot_notification"
										outputName="Wasserstand_LIST_AUF_SYLT_over_undershoot_enter">
										<NotifyOnSelect>
											<Message>Einstiegsklausel</Message>
										</NotifyOnSelect>
									</SelectFunction>
								</SelectFunctions>
								<StructuralOperator>
									<BEFORE />
								</StructuralOperator>
								<FirstPattern>
									<PatternReference>Wasserstand_LIST_AUF_SYLT_over_undershoot_undershoot_stream
									</PatternReference>
									<SelectFunctionNumber>0</SelectFunctionNumber>
								</FirstPattern>
								<SecondPattern>
									<PatternReference>Wasserstand_LIST_AUF_SYLT_over_undershoot_overshoot_stream
									</PatternReference>
									<SelectFunctionNumber>0</SelectFunctionNumber>
								</SecondPattern>
							</ComplexPattern>
							<ComplexPattern
								patternID="Wasserstand_LIST_AUF_SYLT_over_undershoot_undershoot_notification">
								<SelectFunctions>
									<SelectFunction createCausality="true"
										newEventName="Wasserstand_LIST_AUF_SYLT_over_undershoot_undershoot_notification_stream"
										outputName="Wasserstand_LIST_AUF_SYLT_over_undershoot_exit">
										<NotifyOnSelect>
											<Message>Ausstiegsklausel</Message>
										</NotifyOnSelect>
									</SelectFunction>
								</SelectFunctions>
								<StructuralOperator>
									<BEFORE />
								</StructuralOperator>
								<FirstPattern>
									<PatternReference>Wasserstand_LIST_AUF_SYLT_over_undershoot_overshoot_stream
									</PatternReference>
									<SelectFunctionNumber>0</SelectFunctionNumber>
								</FirstPattern>
								<SecondPattern>
									<PatternReference>Wasserstand_LIST_AUF_SYLT_over_undershoot_undershoot_stream
									</PatternReference>
									<SelectFunctionNumber>0</SelectFunctionNumber>
								</SecondPattern>
							</ComplexPattern>
						</ComplexPatterns>
						<TimerPatterns />
						<RepetitivePatterns />
					</EML>
				</wsnt:MessageContent>
			</wsnt:Filter>
		</wsnt:Subscribe>
	</soap:Body>
</soap:Envelope>